//=============================================================================
//レティクル処理[reticule.cpp]
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "reticule.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
//静的メンバ変数の初期化
//=============================================================================
LPDIRECT3DTEXTURE9 CReticule::m_pTexture = NULL;

//=============================================================================
//コンストラクタ
//=============================================================================
CReticule::CReticule(int nPriority)
{

}

//=============================================================================
//デストラクタ
//=============================================================================
CReticule::~CReticule()
{

}

//=============================================================================
//テクスチャの読み込み
//=============================================================================
HRESULT CReticule::Load(void)
{
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = CManager::GetRenderer()->GetDevice();

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,			// デバイスへのポインタ
		TEXTURE_RETICULE,							// ファイルの名前
		&m_pTexture);
	return S_OK;
}

//=============================================================================
//テクスチャの破棄
//=============================================================================
void CReticule::Unload(void)
{
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
//生成処理
//=============================================================================
CReticule * CReticule::Create(float nPosX, float nPosY)
{
	CReticule *pReticule;
	pReticule = new CReticule;
	pReticule->Init(nPosX, nPosY);
	return pReticule;
}

//=============================================================================
//初期化処理
//=============================================================================
HRESULT CReticule::Init(float nPosX, float nPosY)
{
	CScene2D::Init(nPosX, nPosY, RETICULE_WIDTH, RETICULE_HEIGHT);
	CScene2D::BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
//終了処理
//=============================================================================
void CReticule::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
//更新処理
//=============================================================================
void CReticule::Update(void)
{
	//マウスカーソル位置取得
	POINT point;
	GetCursorPos(&point);
	//画面内の座標を適応
	ScreenToClient(FindWindow(CLASS_NAME, NULL), &point);
	//マウスポインタに座標を設定
	SetPosition(D3DXVECTOR3((float)point.x, (float)point.y, 0));
	CScene2D::Update();
}

//=============================================================================
//描画処理
//=============================================================================
void CReticule::Draw(void)
{
	CScene2D::Draw();
}
